export const GAMES  = [
  {
    id: 1,
    image: 'bg-category/01.png',
    name: 'Метро 2033',
    cat: [1, 2],
    count: 'до 12',
    age: '18+',
    time: '1 ч 30 мин',
    text: 'Это не обычный квест или игра. Это интерактивное экшн-шоу с элементами иммерсионного театра, в котором именно вы выбираете, что делать и кем стать! В тоннелях и блоках Бункера-42 вас ждут 10 игровых персонажей, три неординарных ветки развития событий и множество заданий.От простых – закупить и доставить провиант, до сложных и опасных – отыскать пропавшего сталкера или истребить «гостей с поверхности» в вентиляционной шахте. Выполняйте задания, знакомьтесь с жителями метро, поворачивайте сюжетную линию в свою сторону и установите новый порядок в последнем оплоте человечества. В конце концов, именно от ваших действий или бездействия зависит, какая из трёх фракций возьмёт верх!'
  },
  {
    id: 2,
    image: 'bg-category/02.png',
    name: 'Последний штурм',
    cat: [1, 2],
    count: 'до 12',
    age: '18+',
    time: '1 ч 15 мин',
    text: '"Экскурсионная группа", находящаяся в неотреставрированной части Бункера, попадает в заложники к захватчикам. Все дело происходит практически в полной темноте, работает лишь эвакуационный свет.Группе необходимо освободиться, найти склады с оружием,  пробираясь и уничтожая все блокпосты, и уничтожить всех захватчиков. На протяжении всего маршрута они должны найти все тайники с боеприпасами, гранатами и т.д. чтобы дать достойный отпор захватчикам.'
  },
  {
    id: 3,
    image: 'bg-category/03.png',
    name: 'FireTag PVP/PVE',
    cat: [3],
    count: 'до 10',
    age: '18+',
    time: '1 ч 30 мин',
    text: 'ФайерТаг - полная и наиболее достоверная имитация боевых столкновений, позволяющая сражаться с друзьями и коллегами в невероятно реалистичных баталиях. От реального взаимодействия файертаг отличается только тем, что, вместо пули, противника поражает инфракрасный импульс. В качестве базы для излучателя используется охолощённое боевое оружие. Таким образом, достигается небывалый уровень реализма - ИК-излучатель активируется одновременно с холостым выстрелом. Все элементы настоящего оружия сохранены – звук выстрела, отдача, выброс гильзы,реальное количество свето-шумовых патронов. Режимы игры: PVP – игрок против игрока (командами, при достаточном количестве участников; PVE – игрок против окружения (инструкторы Бункера).'
  },
  {
    id: 4,
    image: 'bg-category/04.png',
    name: 'Страйкбол',
    cat: [1],
    count: 'до 10',
    age: '18+',
    time: '1 ч 15 мин',
    text: 'Проводится в неотреставрированной части Бункера. Режимы игры: PVP – игрок против игрока (командами, при достаточном количестве участников; PVE – игрок против окружения (инструкторы Бункера).'
  },
  {
    id: 5,
    image: 'bg-category/05.png',
    name: 'Школа спецназа',
    cat: [3],
    count: 'до 10',
    age: '18+',
    time: '1 ч 30 мин',
    text: 'Овладейте навыками тактического перемещения в любых условиях. Научитесь занимать укрытия и стрелковые позиции, а также эффективно вести огонь по противнику! Однако, не стоит бояться – курс проходит безопасно и увлекательно! Наши инструкторы и лучшее оборудование для файертаг, имитирующее реальные выстрелы, помогут вам почувствовать себя в роли настоящего бойца спецназа!'
  },
  {
    id: 6,
    image: 'bg-category/06.png',
    name: 'Тир',
    cat: [1],
    count: 'до 16',
    age: '12+',
    time: '30 мин',
    text: 'Страйкбольный тир с разными видами мишеней и вооружения. Выберите штурмовой карабин, винтовку или пистолет. А может, гранатомёт? Поражать мишени сообща или в одиночку? Решать вам!'
  },
  {
    id: 7,
    image: 'bg-category/07.png',
    name: 'Команда Б',
    cat: [2],
    count: 'до 16',
    age: '8+',
    time: '1 ч 15 мин',
    text: 'Программа включает в себя знакомство с эргономическиприближённым к настоящему оружием -  лазерными винтовками, а также сопровождающим оборудованием и правилами техники безопасности. После этого следуют игровые раунды, в течение которых игроки в командах разыгрывают различные сценарии боевых столкновений. Площадка оборудована всеми необходимыми укрытиями, а проведение программы обеспечивают опытные и квалифицированные аниматоры. За время, проведенное на площадке, вы получите незабываемые впечатления и проверите крепость плеча товарища!'
  },
  {
    id: 8,
    image: 'bg-category/01.png',
    name: 'Тимбилдинг',
    cat: [1, 2, 3, 4],
    count: 'до 40',
    age: '18+',
    time: '1 ч 15 мин',
    text: 'Активный корпоративный отдых, направленный на сплочение коллектива посредством прохождения различных испытаний и заданий. Тимбилдинг быстро и эффективно  улучшает взаимопонимание в коллективе, тем самым улучшая работу и результаты всей команды. Помогает выявить скрытые таланты и лидерские качества сотрудников.'
  },
  {
    id: 9,
    image: 'bg-category/02.png',
    name: 'Мастер-класс по сбору/разбору Калашникова',
    cat: [4],
    count: 'нет',
    age: '0+',
    time: '1 ч',
    text: 'Включает в себя информацию о сборке, разборке и чистке оружия. Гости могут освоить навык обращения с оружием, получить краткую историческую справку, а также поучаствовать в соревновании на скорость, в том числе и с закрытыми глазами. Проводится в банкетном зале.'
  },
  {
    id: 10,
    image: 'bg-category/03.png',
    name: 'МЕТРО 2033',
    cat: [2, 5],
    count: 'до 12',
    age: '14+',
    time: '1 ч 30 мин',
    text: 'Это не обычный квест или игра. Это интерактивное экшн-шоу с элементами иммерсионного театра, в котором именно вы выбираете, что делать и кем стать! В тоннелях и блоках Бункера-42 вас ждут 10 игровых персонажей, три неординарных ветки развития событий и множество заданий.От простых – закупить и доставить провиант, до сложных и опасных – отыскать пропавшего сталкера или истребить «гостей с поверхности» в вентиляционной шахте.  Выполняйте задания, знакомьтесь с жителями метро, поворачивайте сюжетную линию в свою сторону и установите новый порядок в последнем оплоте человечества. В конце концов, именно от ваших действий или бездействия зависит, какая из трёх фракций возьмёт верх!'
  },
  {
    id: 11,
    image: 'bg-category/04.png',
    name: 'Полигон',
    cat: [2, 5],
    count: 'до 10',
    age: '8-12',
    time: '1 ч 15 мин',
    text: 'Военный-испытательна секретном военном объекте «Бункер-42» встречает группу, и предлагает пройти в испытательную часть бункера, где он создаёт и тестирует лазерное оружие.'
  },
  {
    id: 12,
    image: 'bg-category/05.png',
    name: 'В поисках приключений',
    cat: [2, 5],
    count: 'до 12',
    age: '8+',
    time: '1 ч',
    text: '«Буня» - это сказочный персонаж, который любит детей и взрослых, всех гостей начинает считать своими друзьями. Так же он обожает увлекательные игры и веселые дружные компании. Детишки, у вас дружная компания? Вам нравится смеяться и веселиться? Пригласите Буню к себе на праздник, давайте играть вместе!'
  },
  {
    id: 13,
    image: 'bg-category/06.png',
    name: 'Неожиданное будущее',
    cat: [2, 5],
    count: 'до 16',
    age: '8+',
    time: '1 ч 15 мин',
    text: 'В результате ошибки при вводе данных группа путешественников во времени оказывается в прошлом вместо будущего. И всё бы ничего, но Профессор, который вместе с исследователями перенёсся в Средневековье, как назло, пропал. И, если верить слухам,  по окрестностям бродит Тёмный Рыцарь, чей разум затуманен чёрной магией. Пройдите все испытания, действуйте сообща и одолейте Рыцаря, чтобы вернуться домой!'
  },
  {
    id: 14,
    image: 'bg-category/07.png',
    name: 'Сумасшедший профессор',
    cat: [2, 5],
    count: 'до 16',
    age: '8+',
    time: '1 ч 15 мин',
    text: 'Вам, как группе юных исследователей, выпал уникальный шанс увидеть новейшие разработки Профессора! Однако, познавательная научная экскурсия встаёт под угрозу, так как, Профессор лишился рассудка и вместо кропотливой работы над лазерным оружием, создаёт киборгов из тех, кто к нему попадает! Вам предстоит спасти Профессора от тяжёлого недуга, не став частью его кибер-армии, а также испытать изобретённое им лазерное оружие!'
  },
  {
    id: 15,
    image: 'bg-category/01.png',
    name: 'Команда Б',
    cat: [2, 5],
    count: 'до 16',
    age: '8+',
    time: '1 ч 15 мин',
    text: 'Программа включает в себя знакомство с эргономически приближённым к настоящему оружием -  лазерными винтовками, а также сопровождающим оборудованием и правилами техники безопасности. После этого следуют игровые раунды, в течение которых игроки в командах разыгрывают различные сценарии боевых столкновений. Площадка оборудована всеми необходимыми укрытиями, а проведение программы обеспечивают опытные и квалифицированные аниматоры.  За время, проведенное на площадке, вы получите незабываемые впечатления и проверите крепость плеча товарища!'
  },
  {
    id: 16,
    image: 'bg-category/02.png',
    name: 'Анимационная программа Light',
    cat: [4, 5],
    count: 'нет',
    age: '0+',
    time: '30 мин',
    text: 'Анимационная программа проводится в банкетном зале и включает в себя поздравление от команды аниматоров, торжественный вынос торта и пиньяту. Программа может быть продолжением интерактивной игры, проводится в той же тематике. Внимание: наполнение для пиньяты предоставляется заказчиком.'
  },
  {
    id: 17,
    image: 'bg-category/03.png',
    name: 'Мастер-класс по сбору/разбору Калашникова',
    cat: [4, 5],
    count: 'нет',
    age: '0+',
    time: '1 час',
    text: 'Включает в себя информацию о сборке, разборке и чистке оружия. Гости могут освоить навык обращения с оружием, получить краткую историческую справку, а также поучаствовать в соревновании на скорость, в том числе и с закрытыми глазами. Проводится в банкетном зале.'
  },
  {
    id: 18,
    image: 'bg-category/04.png',
    name: 'Тимбилдинг МЕТРО 2033',
    cat: [1, 4],
    count: 'до 12',
    age: '14+',
    time: '1 час',
    text: 'После ядерной войны остатки человечества были вынуждены перебраться жить под землю. В метро. Там они прожили более 17-ти лет. В любом обществе есть правящие структуры , в метро  это фракции. Игрокам предстоит присоединиться к одной из них, дабы отстаивать её интересы во благо населения всего метро. Игрокам предстоит пройти ряд испытаний, где они будут добывать необходимые ресурсы ( медикаменты, провиант, валюта и т.д.) В конце фракции сравнять между собой количество добытых предметов и выберут новую правящую фракцию. Испытания будут на ловкость, сообразительность и умение договариваться. Метро2033 идеальное место для сплочения командного духа.'
  }
]

export function getGames(limit, cat) {
  let games
  if(cat) {
    games = GAMES.filter(game => (game.cat.includes(cat)) )
  } else {
    games = GAMES
  }
  games = games.slice(-limit)
  return games
}

export function findGame(id) {
  return GAMES.find(game => game.id === id);
}

const gameCategory = [
  { id: 1, name: 'Страйкбол', image: 'bg-category/01.png' },
  { id: 2, name: 'Лазертаг', image: 'bg-category/02.png' },
  { id: 3, name: 'Фаертаг', image: 'bg-category/03.png' },
  { id: 4, name: 'Тимбилдинг', image: 'bg-category/04.png' },
  { id: 5, name: 'Интерактивные игры детские мероприятия', image: 'bg-category/05.png' },
]

export function getGameCategories() {
  return gameCategory
}

export function findGameCategory (id) {
  return gameCategory.find(cat => +cat.id === +id);
}

const POSTS = [
  { id: 1, image: 'news-image/01.jpg', date: '01.08.19', name: '«МЕТРО 2033» в Бункере', cat: 1},
  { id: 2, image: 'news-image/02.jpg', date: '02.08.19', name: 'Тимбилдинг', cat: 2},
  { id: 3, image: 'news-image/03.jpg', date: '03.08.19', name: 'Бункер GAME', cat: 1},
  { id: 4, image: 'news-image/04.jpg', date: '04.08.19', name: 'Тимбилдинг по мотиваи МЕТРО 2033', cat: 1},
  { id: 5, image: 'news-image/05.jpg', date: '05.08.19', name: 'ОБЩИЙ СБОР!!!', cat: 4},
  { id: 6, image: 'news-image/05.jpg', date: '06.08.19', name: 'Открытие игры ФАЕРТАГ', cat: 1},
  { id: 7, image: 'news-image/06.jpg', date: '07.08.19', name: 'Страйкбольный привод KRISS VECTOR', cat: 3},
  { id: 8, image: 'news-image/05.jpg', date: '08.08.19', name: 'Открытие игры ФАЕРТАГ', cat: 3},
  { id: 9, image: 'news-image/06.jpg', date: '09.08.19', name: 'Страйкбольный привод KRISS VECTOR', cat: 4},
  { id: 10, image: 'news-image/03.jpg', date: '10.08.19', name: 'Бункер GAME', cat: 4},
]

const postCategory = [
  { id: 1, name: 'Игры'},
  { id: 2, name: 'Площадка'},
  { id: 3, name: 'Оборудование'},
  { id: 4, name: 'События'},
]

export function getPosts(limit, cat) {
  let posts
  if(cat) {
    posts = POSTS.filter(post => post.cat === cat)
  } else {
    posts = POSTS
  }
  posts = posts.slice(-limit)
  return posts
}

export function findPost(id) {
  return POSTS.find(post => post.id === id);
}

export function getPostCategories() {
  return postCategory
}

export function findPostCategory (id) {
  return postCategory.find(post => post.id === id);
}

