export const games = [
  { id: 1, image: 'bg-category/07.png', name: 'Сумасшедший профессор', cat: ['Интерактивная игра', 'Фаертаг'], text: 'Вам, как группе исследователей, выпал уникальный шанс увидеть новейшие разработки Профессора! Однако научная экспедиция под угрозой срыва!', count: 'до 16', age: '9+', time: '1 час 15 минут'},
  { id: 2, image: 'bg-category/06.png', name: 'FIRETAG PVP', cat: ['Фаертаг'], text: 'ФайерТаг - полная и наиболее достоверная имитация боевых столкновений, позволяющая сражаться с друзьями и коллегами в невероятно реалистичных баталиях.', count: 'до 10', age: '18+', time: '1 час 30 минут'},
  { id: 3, image: 'bg-category/05.png', name: 'Страйкбол PVP/PVE', cat: ['Страйкбол'], text: 'PVP (Player Versus Player – Игрок против игрока).PVE (Player Versus Environment – игрок против окружения, в качестве которого выступают инструкторы игрового отдела Бункер-42).', count: 'от 4 до 10', age: '18+', time: '1 час 15 минут'},
  { id: 4, image: 'bg-category/04.png', name: 'Последний штурм', cat: ['Страйкбол'], text: '«Экскурсионная» группа, находящаяся в не отреставрированной части, попадает в заложники к «захватчикам» бункера.', count: 'до 12', age: '18+', time: '1 час 15 минут'},
  { id: 5, image: 'bg-category/07.png', name: 'Сумасшедший профессор', cat: ['Интерактивная игра', 'Страйкбол'], text: 'Вам, как группе исследователей, выпал уникальный шанс увидеть новейшие разработки Профессора! Однако научная экспедиция под угрозой срыва!', count: 'до 16', age: '9+', time: '1 час 15 минут'},
  { id: 6, image: 'bg-category/06.png', name: 'FIRETAG PVP', cat: ['Фаертаг'], text: 'ФайерТаг - полная и наиболее достоверная имитация боевых столкновений, позволяющая сражаться с друзьями и коллегами в невероятно реалистичных баталиях.', count: 'до 10', age: '18+', time: '1 час 30 минут'},
  { id: 7, image: 'bg-category/05.png', name: 'Страйкбол PVP/PVE', cat: ['Страйкбол'], text: 'PVP (Player Versus Player – Игрок против игрока).PVE (Player Versus Environment – игрок против окружения, в качестве которого выступают инструкторы игрового отдела Бункер-42).', count: 'от 4 до 10', age: '18+', time: '1 час 15 минут'},
  { id: 8, image: 'bg-category/04.png', name: 'Последний штурм', cat: ['Страйкбол'], text: '«Экскурсионная» группа, находящаяся в не отреставрированной части, попадает в заложники к «захватчикам» бункера.', count: 'до 12', age: '18+', time: '1 час 15 минут'},
]

export const news = [
  { id: '1', date: '9.08.19', name: '«МЕТРО 2033» в Бункере', cat: 'Игры', image: 'news-image/01.jpg' },
  { id: '2', date: '9.08.19', name: 'Тимбилдинг', cat: 'Площадка', image: 'news-image/02.jpg' },
  { id: '3', date: '9.08.19', name: 'Бункер GAME', cat: 'Игры', image: 'news-image/03.jpg' },
  { id: '4', date: '9.08.19', name: 'Тимбилдинг по мотиваи МЕТРО 2033', cat: 'Игры', image: 'news-image/04.jpg' },
  { id: '5', date: '9.08.19', name: 'ОБЩИЙ СБОР!!!', cat: 'Площадка', image: 'news-image/05.jpg' },
  { id: '6', date: '9.08.19', name: 'Открытие игры ФАЕРТАГ', cat: 'Игры', image: 'news-image/05.jpg' },
  { id: '7', date: '9.08.19', name: 'Страйкбольный привод KRISS VECTOR', cat: 'Оборудование', image: 'news-image/06.jpg' },
]